In [1]:
import pandas as pd

In [7]:
name_table = pd.DataFrame(columns = ['Name'], index = ['V001','V002','V003','V004'], data = ['Abe', 'Abhay', 'Acelin', 'Adelphos'])
name_test = pd.DataFrame(columns = ['Name'], index = ['V001','V002','V003','V004','V005','V006'], data = ['Gabe', 'eee', 'aaE', 'aaa','Justin',"Todd"])
mark_table = pd.DataFrame(columns = ['Total_marks'], index = ['V001','V002','V003','V004'], data = [95, 80, 74, 81])

In [3]:
def upper_if_e(name_table):
    """
    returns a new data frame version of name_table, where each name containing the letter “e” is uppercased, 
    and lowercased otherwise.
    
    :param name_table: A dataframe containing the names of people.
    :return: A new dataframe where every name that contained the letter 'e' is uppercased and names that
    did contain 'e' are lower cased. 
    :rtype: Dataframe
    
    Example: “Edward” → “EDWARD”, “Bob” → “bob”
    """
    names = name_table['Name']
    new_df = name_table.copy()
    #if the string does not contain e. ~ is the negation operator.
    new_df.loc[~ new_df.Name.str.contains('e'), 'Name'] = new_df.Name.str.lower()
    new_df.loc[new_df.Name.str.contains('e'), 'Name'] = new_df.Name.str.upper()
    return new_df

In [4]:
upper_if_e(name_test)

        Name
V001    GABE
V002     EEE
V003     AAE
V004     aaa
V005  justin
V006    todd

In [18]:
cased_df = upper_if_e(name_table)
cased_df

          Name
V001       ABE
V002     abhay
V003    ACELIN
V004  ADELPHOS

In [39]:
def summarize_avg_grade(new_name_table, mark_table):
    """
    returns a new data frame containing the average of the grades contained within mark_table for uppercased 
    names and lowercased names contained within new_name_table.
    
    :param new_name_table: A dataframe containing the names of people. The names should be all uppercased or all
    lowercased.
    :param mark_table: A dataframe containing grades.
    :return: A new dataframe containing the average score for upper case names and lower case names.
    :rtype: Dataframe
    
    """
    #merge the dataframes by their index. 
    combined_df = new_name_table.merge(mark_table, left_index=True, right_index=True)
    upper_avg = combined_df[combined_df.Name.str.isupper()].mean()
    lower_avg = combined_df[combined_df.Name.str.islower()].mean()
    averages_df = pd.DataFrame({"Uppercase Average": upper_avg, "Lowercase Average": lower_avg})
    return averages_df

In [40]:
summarize_avg_grade(cased_df,mark_table)

             Uppercase Average  Lowercase Average
Total_marks          83.333333               80.0

In [43]:
wh_salaries_df = pd.read_csv('https://raw.githubusercontent.com/helloworlddata/white-house-salaries/master/data/converted/2017.csv')

In [44]:
wh_salaries_df.head()

,NAME,STATUS,SALARY,PAY BASIS,POSITION TITLE
0,"Alexander, Monica K.",Employee,"$56,000.00",Per Annum,EXECUTIVE ASSISTANT
1,"Ambrosini, Michael J.",Employee,"$95,000.00",Per Annum,SPECIAL ASSISTANT TO THE PRESIDENT AND DIRECTO...
2,"Amin, Stacy C.",Employee,"$140,000.00",Per Annum,SPECIAL ASSISTANT TO THE PRESIDENT AND ASSOCIA...
3,"Andersen, Whitney N.",Employee,"$94,000.00",Per Annum,DEPUTY DIRECTOR OF OPERATIONS FOR THE WHITE HO...
4,"Anderson, Alexander J.",Employee,"$77,000.00",Per Annum,DIRECTOR OF DIGITAL ENGAGEMENT